from pprint import pprint

import pandas as pd
import xlsxwriter

WA_to_35_rec1 = {
    'vowel': ['a', 'i', 'y', 'a', 'i', 'i', 'a', 'i'],
    'F1': [1511.545, 1872.927, 1681.018, 900.332, 723.929, 624.035, 1011.757, 639.1721],
    'F2': [2827.090, 2895.345, 2640.195, 1723.464, 2493.915, 2422.890, 1929.013, 2548.664],
    'pitch': [248.708, 336.239, 391.437, 413.982, 426.641,431.969, 413.194, 488.851],
    'min_pitch': [240.257, 69.923, 414.600, 408.635, 422.835, 427.479, 403.809, 474.331],
    'max_pitch': [253.934, 348.725, 419.824, 428.583, 431.352, 435.727, 418.379, 498.458],
    'int': [63.462, 72.353, 66.646, 69.357, 69.794, 70.684, 66.566, 68.698],
    'min_int': [57.936, 69.923, 63.149, 67.285, 68.125, 70.622, 61.773, 68.276],
    'max_int': [65.130, 73.584, 67.852, 70.717, 70.718, 70.822, 68.291, 69.075
],
    'stressed': [False, False, True, True, False, True, True, False]
}

WR_to_35_rec51 = {
    'vowel': ['a', 'i', 'y', 'a', 'i', 'i', 'a', 'i'],
    'F1': [876.138, 983.544, 972.140, 904.375, 2452.959, 679.656, 941.077, 873.884],
    'F2': [2017.322, 2844.910, 2166.475, 1962.069, 3062.314, 2682.427, 2045.157, 2223.957],
    'pitch': [313.760, 434.691, 462.497, 386.529, 370.049, 397.816, 336.485, 258.539],
    'min_pitch': [299.145, 434.138, 448.018, 371.525, 367.662, 395.417, 370.248, 252.971],
    'max_pitch': [318.700, 437.408, 470.117, 403.342, 375.865, 402.600, 495.434, 260.806],
    'int': [68.593, 69.755, 66.270, 70.984, 64.537, 71.252, 65.788, 70.012],
    'min_int': [64.529, 68.570, 65.610, 69.015, 63.509, 69.269, 56.540, 68.553],
    'max_int': [71.288, 70.394, 67.065, 72.645, 65.451, 72.760, 68.812, 71.424],
    'stressed': [False, False, True, True, False, True, True, False]
}

WA_up_35_rec16 = {
    'vowel': ['a', 'a', 'a', 'y', 'o', 'i', 'o', 'i', 'i', 'y', 'a'],
    'F1': [745.972, 1031.952, 1502.996, 812.554, 503.665, 957.240, 1673.025, 811.252, 923.434, 676.196, 1401.020],
    'F2': [2026.239, 2062.019, 2548.465, 2360.115, 2188.426, 2001.169, 2725.451, 2405.638, 1927.084, 1885.857, 2130.617],
    'pitch': [230.596, 265.389, 326.038, 357.002, 394.903, 229.366, 420.284, 432.362, 432.392, 274.676, 243.443],
    'min_pitch': [216.037, 258.937, 323.136, 355.707, 380.692, 232.034, 418.766, 430.359, 431.832, 214.676, 266.411],
    'max_pitch': [236.037, 278.247, 330.315, 359.584, 403.570, 236.037, 424.379, 437.526, 433.568, 274.676, 272.322],
    'int': [65.308, 62.347, 64.946, 63.873, 66.123, 61.305, 70.290, 69.991, 62.883, 66.607, 66.607],
    'min_int': [65.052, 55.199, 63.482, 60.646, 60.925, 61.041, 62.743, 69.806, 61.023, 65.541, 65.541],
    'max_int': [65.713, 63.706, 65.850, 66.350, 67.694, 68.377, 424.379, 70.188, 64.334, 67.828, 67.828],
    'stressed': [True, False, False, True, True, True, True, False, False, True, False]
}


MR_up_35_rec52 = {
    'vowel': ['a', 'a', 'a', 'y', 'o', 'i', 'o', 'i', 'i', 'y', 'a'],
    'F1': [743.522, 887.217, 661.391, 1908.620, 1545.734, 568.398, 550.448, 568.651, 880.058, 638.187, 1636.768],
    'F2': [1824.698, 1484.986, 1786.935, 2696.898, 2965.733, 2338.216, 2515.032, 1515.178, 2840.487, 1848.264, 2351.574],
    'pitch': [192.621, 259.255, 287.575, 313.627, 392.332, 325.565, 287.575, 310.525, 293.504, 291.970, 300.801],
    'min_pitch': [187.289, 258.384, 280.517, 303.627, 379.423, 324.440, 280.517, 282.017, 431.832, 291.970, 300.801],
    'max_pitch': [200.830, 261.989, 291.990, 313.627, 401.320, 371.648, 291.990, 329.485, 300.084, 291.970, 300.801],
    'int': [67.924, 65.603, 65.904, 66.064, 66.064, 66.123, 64.327, 70.278, 65.904, 68.581, 63.720],
    'min_int': [64.697, 65.603, 64.228, 65.290, 60.925, 68.347, 64.228, 64.494, 61.094, 55.209, 58.824],
    'max_int': [69.359, 67.764, 66.756, 67.416, 67.694, 71.648, 66.756, 70.405, 65.635, 70.211, 72.196],
    'stressed': [True, False, False, True, True, True, True, False, False, True, False]
}


WA_to_35 = pd.DataFrame(WA_to_35_rec1)
WR_to_35 = pd.DataFrame(WR_to_35_rec51)

WA_up_35 = pd.DataFrame(WA_up_35_rec16)
MR_up_35 = pd.DataFrame(MR_up_35_rec52)
#print(WA_to_35, WR_to_35, WA_up_35, MR_up_35)

#df.loc[len(df.index)] = ['y', '517.628','1441.161','253.97', '231.07', '260.96', '83.43', '75.76', '85.07', 'False']
#df2 = pd.DataFrame ({
#     'vowel': ['i', 'i'],
#     'F1': [439.692, 728.442],
#     'F2': [2082.735, 2712.785],
#     'pitch': [231.83, 249.77],
#     'min_pitch': [225.37, 234.07],
#     'max_pitch': [239.51, 255.23],
#     'int': [72.47, 75.97],
#     'min_int': [70.23, 73.93],
#     'max_int': [73.59, 77.29],
#     'stressed': [False, True],
# })
# df = df.append(df2, ignore_index = True )


#df.to_csv('sounds_kab.csv', index=False)
#запись в csv

#print(df)

#df_dict = df.to_dict()
#pprint(df_dict)
#приведение к словарю python



#выбрать нужные столбцы
#row = df.loc[df['vowel'] == 'i', ['vowel', 'F1']]
## same
iarmw351 = WR_to_35.query("vowel == 'i'")[['vowel', 'F2']]



aarmw351 = WR_to_35.query("vowel == 'a'")[['vowel', 'F2']]
yarmw351 = WR_to_35.query("vowel == 'y'")[['vowel', 'F2']]
iarmw351 = iarmw351._append(aarmw351, ignore_index = True)
iarmw351 = iarmw351._append(yarmw351, ignore_index = True)


       #aarmw35, yarmw35)
# lists = df.loc[df['vowel'] == 'a', ['vowel', 'F1']]
## same df.query("vowel == 'a'")[['vowel', 'F1']]
# row = df.loc[df['vowel'] == 'y', ['vowel', 'F1']]
## same df.query("vowel == 'y'")[['vowel', 'F1']]
#rows.to_csv('i_kab.csv', index=False)




#to excel
# filtered_df = df.query("vowel == 'i'")[['vowel', 'F1']]
#
# Создание нового файла Excel
workbook = xlsxwriter.Workbook('output2.xlsx')

# Добавление нового листа в файл
worksheet = workbook.add_worksheet()

# Запись заголовков столбцов
headers = list(iarmw351.columns)
for col_num, header in enumerate(headers):
    worksheet.write(0, col_num, header)

# Запись данных
for row_num, row_data in enumerate(iarmw351.values):
    for col_num, cell_data in enumerate(row_data):
        worksheet.write(row_num + 1, col_num, cell_data)

# Закрытие файла
workbook.close()



